---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ad.3103/Dropbox/Research/Prediction markets/Harvard Replications/EricsonFuster/analys
> is/main.log
  log type:  text
 opened on:   9 Nov 2015, 17:00:07

. set seed 1 //Set seed for comparability

. 
. /* START */
. 
. import delimited "data.csv"
(78 vars, 262 obs)

. 
. gen diff = wtamug - wtapen

. 
. gen log_wta_mug = ln(wtamug)
(13 missing values generated)

. gen log_wta_pen = ln(wtapen)
(4 missing values generated)

. gen logdiff = log_wta_mug - log_wta_pen
(14 missing values generated)

. 
. /* MAIN TEST */
. ttest diff, by(hightreat) une

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     119    -.280084    .2309949    2.519857   -.7375169    .1773488
       1 |     143    .3553846    .2279997     2.72648   -.0953277    .8060969
---------+--------------------------------------------------------------------
combined |     262    .0667557    .1636372      2.6487   -.2554615     .388973
---------+--------------------------------------------------------------------
    diff |           -.6354686    .3245651               -1.274613    .0036757
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.9579
Ho: diff = 0                     Satterthwaite's degrees of freedom =  257.121

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0257         Pr(|T| > |t|) = 0.0513          Pr(T > t) = 0.9743

. ttest logdiff, by(hightreat) une

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     110   -.0876321    .0803631    .8428552   -.2469091    .0716449
       1 |     138    .1320849    .0805218    .9459174   -.0271415    .2913113
---------+--------------------------------------------------------------------
combined |     248    .0346298    .0575629    .9065018    -.078747    .1480066
---------+--------------------------------------------------------------------
    diff |            -.219717    .1137629               -.4438046    .0043705
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.9314
Ho: diff = 0                     Satterthwaite's degrees of freedom =  242.921

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0273         Pr(|T| > |t|) = 0.0546          Pr(T > t) = 0.9727

. 
. /* MORE DATA*/
. 
. * average WTA
. ttest wtamug, by(hightreat) une

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     119    3.359622     .244128    2.663122    2.876182    3.843062
       1 |     143    4.307308     .225804    2.700223    3.860936    4.753679
---------+--------------------------------------------------------------------
combined |     262     3.87687     .168024    2.719706    3.546015    4.207725
---------+--------------------------------------------------------------------
    diff |           -.9476858    .3325446               -1.602599   -.2927728
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.8498
Ho: diff = 0                     Satterthwaite's degrees of freedom =  252.621

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0024         Pr(|T| > |t|) = 0.0047          Pr(T > t) = 0.9976

. ttest log_wta_mug, by(hightreat) une

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     111     .863466    .1063276    1.120231    .6527497    1.074182
       1 |     138    1.221408    .0767647    .9017812    1.069611    1.373205
---------+--------------------------------------------------------------------
combined |     249    1.061843    .0645538    1.018641    .9346998    1.188987
---------+--------------------------------------------------------------------
    diff |           -.3579418    .1311426               -.6164738   -.0994099
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.7294
Ho: diff = 0                     Satterthwaite's degrees of freedom =  208.971

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0034         Pr(|T| > |t|) = 0.0069          Pr(T > t) = 0.9966

. ttest wtapen, by(hightreat) une

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     119    3.639706    .2399996    2.618086    3.164441     4.11497
       1 |     143    3.951923    .2289739     2.73813    3.499285    4.404561
---------+--------------------------------------------------------------------
combined |     262    3.810114    .1657989     2.68369    3.483641    4.136588
---------+--------------------------------------------------------------------
    diff |           -.3122172     .331706               -.9654491    .3410147
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.9412
Ho: diff = 0                     Satterthwaite's degrees of freedom =  255.009

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1737         Pr(|T| > |t|) = 0.3475          Pr(T > t) = 0.8263

. mean(wtamug)

Mean estimation                   Number of obs   =        262

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
      wtamug |    3.87687    .168024      3.546015    4.207725
--------------------------------------------------------------

. mean(wtapen)

Mean estimation                   Number of obs   =        262

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
      wtapen |   3.810114   .1657989      3.483641    4.136588
--------------------------------------------------------------

. 
. tab hightreat if wtamug==0

  HighTreat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          8       61.54       61.54
          1 |          5       38.46      100.00
------------+-----------------------------------
      Total |         13      100.00

. tab hightreat if wtapen==0

  HighTreat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       25.00       25.00
          1 |          3       75.00      100.00
------------+-----------------------------------
      Total |          4      100.00

. 
. * Regressions 1-5 in Table 2
. 
. * Regression 1
. eststo reg1 : regress log_wta_mug hightreat 

      Source |       SS           df       MS      Number of obs   =       249
-------------+----------------------------------   F(1, 247)       =      7.80
       Model |  7.88184069         1  7.88184069   Prob > F        =    0.0056
    Residual |   249.45049       247  1.00992101   R-squared       =    0.0306
-------------+----------------------------------   Adj R-squared   =    0.0267
       Total |  257.332331       248  1.03763037   Root MSE        =    1.0049

------------------------------------------------------------------------------
 log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |   .3579418   .1281275     2.79   0.006       .10558    .6103037
       _cons |    .863466   .0953855     9.05   0.000     .6755933    1.051339
------------------------------------------------------------------------------

. 
. * Regression 2
. * include a constant indicator for wtapen=9.57 (may be censored then)
. gen pen_max_wta = 0

. replace pen_max_wta = 1 if wtapen>9.5
(12 real changes made)

. eststo reg2 : regress log_wta_mug hightreat log_wta_pen pen_max_wta

      Source |       SS           df       MS      Number of obs   =       248
-------------+----------------------------------   F(3, 244)       =     44.08
       Model |  87.5533997         3  29.1844666   Prob > F        =    0.0000
    Residual |  161.545355       244  .662071127   R-squared       =    0.3515
-------------+----------------------------------   Adj R-squared   =    0.3435
       Total |  249.098755       247  1.00849698   Root MSE        =    .81368

------------------------------------------------------------------------------
 log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |    .266027   .1041829     2.55   0.011     .0608145    .4712396
 log_wta_pen |   .5989179   .0559555    10.70   0.000     .4887004    .7091353
 pen_max_wta |   -.111692   .2512119    -0.44   0.657    -.6065126    .3831286
       _cons |   .3086314   .0936622     3.30   0.001     .1241418     .493121
------------------------------------------------------------------------------

. 
. * Regression 3 - add controls
. eststo reg3 : regress log_wta_mug hightreat log_wta_pen female age pen_max_wta i.day

      Source |       SS           df       MS      Number of obs   =       248
-------------+----------------------------------   F(9, 238)       =     15.60
       Model |   92.439921         9  10.2711023   Prob > F        =    0.0000
    Residual |  156.658834       238  .658230394   R-squared       =    0.3711
-------------+----------------------------------   Adj R-squared   =    0.3473
       Total |  249.098755       247  1.00849698   Root MSE        =    .81131

------------------------------------------------------------------------------
 log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |    .268778   .1055632     2.55   0.012     .0608205    .4767356
 log_wta_pen |   .5974338   .0567394    10.53   0.000     .4856583    .7092092
      female |   .1971945   .1078407     1.83   0.069    -.0152496    .4096387
         age |  -.0156312   .0198146    -0.79   0.431    -.0546655    .0234031
 pen_max_wta |  -.1268347    .259278    -0.49   0.625    -.6376076    .3839382
             |
         day |
          2  |   .1520699   .1933074     0.79   0.432    -.2287421     .532882
          3  |    .268385   .2115465     1.27   0.206    -.1483576    .6851276
          4  |   .1941532   .1871593     1.04   0.301    -.1745472    .5628535
          5  |  -.0152106   .2086107    -0.07   0.942    -.4261697    .3957486
             |
       _cons |   .3812395   .4684939     0.81   0.417    -.5416848    1.304164
------------------------------------------------------------------------------

. 
. * Reg 4 is tobit that takes censoring at WTA_mug=9.57 into account
. * ln(9.57) = 2.2586332
. tobit log_wta_mug hightreat log_wta_pen female age pen_max_wta i.day, ul(2.2586331)

Tobit regression                                Number of obs     =        248
                                                LR chi2(9)        =     114.36
                                                Prob > chi2       =     0.0000
Log likelihood = -300.53104                     Pseudo R2         =     0.1599

------------------------------------------------------------------------------
 log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |   .2778994    .107414     2.59   0.010     .0663003    .4894985
 log_wta_pen |   .6108019   .0577059    10.58   0.000     .4971248    .7244791
      female |   .2210791   .1097278     2.01   0.045      .004922    .4372363
         age |  -.0127813   .0203614    -0.63   0.531    -.0528921    .0273295
 pen_max_wta |  -.0349715   .2707467    -0.13   0.897    -.5683261    .4983831
             |
         day |
          2  |   .1129854   .1969253     0.57   0.567    -.2749456    .5009163
          3  |   .2712363   .2161583     1.25   0.211    -.1545824    .6970549
          4  |   .1914425   .1909968     1.00   0.317    -.1848097    .5676946
          5  |  -.0425748   .2122804    -0.20   0.841    -.4607542    .3756047
             |
       _cons |   .3188632   .4811442     0.66   0.508    -.6289618    1.266688
-------------+----------------------------------------------------------------
      /sigma |   .8217088   .0380182                      .7468152    .8966024
------------------------------------------------------------------------------
             0  left-censored observations
           237     uncensored observations
            11 right-censored observations at log_wta_mug >= 2.2586331

. * display marginal effects
. eststo reg4 : margins, dydx(*) atmeans post

Conditional marginal effects                    Number of obs     =        248
Model VCE    : OIM

Expression   : Linear prediction, predict()
dy/dx w.r.t. : hightreat log_wta_pen female age pen_max_wta 2.day 3.day 4.day 5.day
at           : hightreat       =    .5564516 (mean)
               log_wta_pen     =    1.038761 (mean)
               female          =     .608871 (mean)
               age             =    21.32258 (mean)
               pen_max_wta     =    .0483871 (mean)
               1.day           =    .1008065 (mean)
               2.day           =         .25 (mean)
               3.day           =    .1491935 (mean)
               4.day           =    .3387097 (mean)
               5.day           =    .1612903 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |   .2778994    .107414     2.59   0.010     .0673718     .488427
 log_wta_pen |   .6108019   .0577059    10.58   0.000     .4977004    .7239035
      female |   .2210791   .1097278     2.01   0.044     .0060166    .4361417
         age |  -.0127813   .0203614    -0.63   0.530    -.0526889    .0271264
 pen_max_wta |  -.0349715   .2707467    -0.13   0.897    -.5656253    .4956822
             |
         day |
          2  |   .1129854   .1969253     0.57   0.566    -.2729812    .4989519
          3  |   .2712363   .2161583     1.25   0.210    -.1524261    .6948987
          4  |   .1914425   .1909968     1.00   0.316    -.1829044    .5657893
          5  |  -.0425748   .2122804    -0.20   0.841    -.4586366    .3734871
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. * include cubic wtapen
. eststo reg5 : regress log_wta_mug hightreat female age pen_max_wta c.wtapen##c.wtapen##c.wtapen i.day

      Source |       SS           df       MS      Number of obs   =       249
-------------+----------------------------------   F(11, 237)      =     12.37
       Model |  93.8777244        11  8.53433858   Prob > F        =    0.0000
    Residual |  163.454606       237  .689681883   R-squared       =    0.3648
-------------+----------------------------------   Adj R-squared   =    0.3353
       Total |  257.332331       248  1.03763037   Root MSE        =    .83047

--------------------------------------------------------------------------------------------
               log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
                 hightreat |   .2919946   .1078258     2.71   0.007     .0795752    .5044141
                    female |   .1903184   .1105167     1.72   0.086    -.0274021    .4080389
                       age |  -.0196568   .0203723    -0.96   0.336    -.0597906    .0204771
               pen_max_wta |   -1.02166   .4701603    -2.17   0.031    -1.947887   -.0954332
                    wtapen |   1.303914    .202622     6.44   0.000     .9047436    1.703084
                           |
         c.wtapen#c.wtapen |  -.2679346   .0537827    -4.98   0.000    -.3738879   -.1619814
                           |
c.wtapen#c.wtapen#c.wtapen |    .017645   .0040097     4.40   0.000     .0097458    .0255443
                           |
                       day |
                        2  |   .1613505   .1979246     0.82   0.416    -.2285658    .5512668
                        3  |   .2935654   .2164321     1.36   0.176     -.132811    .7199418
                        4  |   .2022628   .1911679     1.06   0.291    -.1743426    .5788683
                        5  |   .0083969   .2134422     0.04   0.969    -.4120895    .4288832
                           |
                     _cons |  -.7040449   .5125791    -1.37   0.171    -1.713838    .3057483
--------------------------------------------------------------------------------------------

. 
. esttab using table2.rtf, replace title(Replication of Table II) label ///
>         indicate("Day indicators = *.day" "Other controls = wtapen*") ///
>         nomtitles noconstant se starlevels(* 0.10 ** 0.05 *** 0.01)
(output written to table2.rtf)

.         
. 
. /* EXTRA CHECKS */      
. *constraint define 1 log_wta_pen=1
. *cnsreg log_wta_mug hightreat log_wta_pen, constraint(1)
. * reg2 utan censoring
. regress log_wta_mug hightreat log_wta_pen

      Source |       SS           df       MS      Number of obs   =       248
-------------+----------------------------------   F(2, 245)       =     66.24
       Model |  87.4225212         2  43.7112606   Prob > F        =    0.0000
    Residual |  161.676233       245  .659902994   R-squared       =    0.3510
-------------+----------------------------------   Adj R-squared   =    0.3457
       Total |  249.098755       247  1.00849698   Root MSE        =    .81234

------------------------------------------------------------------------------
 log_wta_mug |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   hightreat |   .2662463    .104011     2.56   0.011     .0613764    .4711161
 log_wta_pen |    .591831   .0535493    11.05   0.000     .4863552    .6973068
       _cons |   .3104665   .0934179     3.32   0.001     .1264619    .4944711
------------------------------------------------------------------------------

. 
. 
. /* END */
. log close
      name:  <unnamed>
       log:  /Users/ad.3103/Dropbox/Research/Prediction markets/Harvard Replications/EricsonFuster/analys
> is/main.log
  log type:  text
 closed on:   9 Nov 2015, 17:00:07
---------------------------------------------------------------------------------------------------------
